/*========================*/
/*     C언어 3월 3주차    */
/*    2037053  이제원     */
/*   역 피라미드 만들기   */
/*========================*/
#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

int main()
{	
	//변수를 설정
	int i, j, floor;
	
	printf("몇층을 쌓을까요?\n");
	scanf("%d", &floor);
	
	//원하는 층만큼 역 피라미드 쌓는다.
	for (i = floor ; i >= 0; i--)
	{
		for (j = 0; j < i; j++)
		{
			printf("*");
		}
				
		printf("\n");
	}
	


	/*
	==================
		예상  출력
	==================
		 *******
		 *****
		 ***
		 *         */
	
	
	////변수를 설정한다.
	//int i, k, j, floor;

	//printf("몇층을 쌓을까요?\n");
	//scanf("%d", &floor);

	////원하는 층만큼 역 피라미드를 쌓는다.
	//for (i = floor-1 ; i >= 0; i--)
	//{
	//	for (k = i; k < floor - 1; k++)
	//	{
	//		printf(" ");
	//	}

	//	for (j = 0; j < i * 2 + 1; j++)
	//	{
	//		printf("*");
	//	}
	//	printf("\n");
	//}
	return 0;

/*
==================
	예상  출력
==================
	 *******
	  *****
	   ***
		*         */

}

